//Варіант 8. Клас «Записна книжка»
//Створити структуру «ЗАПИС»:
//- прізвище;
//- номер телефону;
//- дата народження;
//- коментар.
//До закритих полів добавити:
//- об’єкт структури «ЗАПИС».
//До відкритих методів добавити:
//- функцію повертає дату народження;
//- функцію яка встановлює коментар через параметр.
//- функцію без параметрів. яка в дане-член коментар записує «немає
//коментарів».
//В конструкторі створити динамічний масив структур типу «ЗАПИС». В
//конструкторі зчитати дані з текстового файлу (крім коментаря) у масив структур.
//Кількість елементів масиву задається з текстового файлу.
//Приклад текстового файлу (as.txt):
//2
//Філіпчук
//80974312117
//25.4.1989
//Філіпов
//80981234567
//21.3.1988
import java.io.IOException;

class Main{
    public static void main(String[] args) throws IOException {
        Records records = new Records("lutskin","+380635626695","10/09/2004", "no coments");
        records.birthDay();
        records.setComment();
        records.read();

    }
}